{"data":{"site":{"siteMetadata":{"title":"Eric Pelz","author":"Eric Pelz"}},"markdownRemark":{"id":"125f7a68-6a4e-5c6a-aa51-d119d89db627","excerpt":"Reducing risk, eliminating complexity, and sequencing effectively With perfect information, an engineering design process can be pretty\nstraightforward: you can…","html":"<h2>Reducing risk, eliminating complexity, and sequencing effectively</h2>\n<p>With perfect information, an engineering design process can be pretty\nstraightforward: you can focus on implementing functionality while minimizing\nengineering complexity and risk. But this gets a lot trickier when there are a\nlot of product uncertainties. How do you make an engineering plan when you don’t\nknow how it will be used or extended? In these cases, you need to have a strong\ndialogue between product and engineering — healthy teams don’t silo each person,\nbut have them work together as one team. Through this, you can plan to maximize\nuser value through incremental releases, by minimizing product and engineering\nrisk.</p>\n<h3>The most interesting types of engineering problems</h3>\n<p>At Asana, I’ve been the tech lead of a few different teams, and have seen\nfirst-hand that each team has its own joys and challenges in the engineering\ndesign process. For example, one team involved rewriting an unperformant feature\nto a new framework. This meant that the team had a well-defined product with\nlittle uncertainty, as the feature was already launched. In this team, we only\nsolved engineering problems: e.g. how to write efficient queries, differences\nbetween our old and new frameworks that could impact the product, and how to\nbuild abstractions to harness the power of the feature.</p>\n<p>My favorite kinds of teams involve much more product collaboration. When\nbuilding powerful new features, there are many types<sup id=\"fnref-1\"><a href=\"#fn-1\" class=\"footnote-ref\">1</a></sup> of risk at play —\nproduct and engineering are two of the most common — and you need to think of\nthem all when planning a product engineering project. Product risk can be very\ndangerous: if you build the wrong feature, you might need to re-build the right\nfeature afterwards. At best, this means wasting some time. At worst, this means\nbuilding and maintaining two separate systems instead of one. This means the\nscope of problem solving changes completely, as an engineer needs to be a\npartner in the product process and think through both engineering and product\ntradeoffs.</p>\n<p>In other words, be involved in all stages of the product process. Do this from\nthe start, even before identifying the problem statement and initial hypotheses.\nYou will be better equipped to think through product tradeoffs and be a good\npartner to your product manager. Similarly, a product manager should be a\npartner in the engineering process. They should understand where complexities or\nlegacy technologies live, intuit which solutions are simpler, and so on. A\nsuccessful collaboration results in a better product delivered with higher\nvelocity.</p>\n<h3>How to approach these problems</h3>\n<p>Unfortunately, many engineers focus on an extreme when they see multiple types\nof risk. If there is large product risk, they’ll prototype to deliver value as\nfast as possible, which could harm their future viability. On the other side,\nthey might over-abstract and focus too much on the long-term feature-set,\nrisking added complexity and delaying when they deliver value. The ideal path\nforward is to be somewhere in the middle, and balance the product and\nengineering concerns.</p>\n<p>If you’re at a product company, your ultimate goal is likely to deliver user\nvalue. There’s a lot to consider: what user benefit will you deliver, what risk\nwill that have, when will the release occur, what engineering debt will you add,\nand so on. The danger is when these factors aren’t considered when planning a\nproject. That likely happens when it’s assumed that someone else will consider\nthe factors (i.e. the PM will think about product risk, and you, the engineer,\nonly need to care about engineering planning).</p>\n<h3>Brief interlude: concretely modeling this</h3>\n<p>Bear with me for a moment, we’ll return in a minute — but it’s helpful to think\nof this from the perspective of economics. Suppose you have a project which you\nare developing an engineering plan for. You can deliver it all at once, or\nthrough a series of incremental releases. We want to maximize the expected value\nfor hypothetical releases. If you squint a bit, we can model this the same way\nas <a href=\"https://en.wikipedia.org/wiki/RNPV\">risk-adjusted net present value</a> in\neconomics. We have a series of “releases” at different points of time, each with\na different risk profile and net value. Since we prefer value as soon as\npossible, we “discount” the value based on when it will occur.</p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/6b0c6eaeb15104ad1cd09520cf79d313/87bc8/equation.png\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 20.265486725663717%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAECAYAAACOXx+WAAAACXBIWXMAAAsSAAALEgHS3X78AAAAdklEQVQY043PwQqCQBSF4VkUKo3KCBqRYk2hCCm46f0frf/CWYRINPBtLtwz5zr3/3ui3cyO6JB8D194Y8IdD4wYEJEix4oMFU4oEHBDg1LcRSFRDaLCLLxXiFm0bEtnXFHrAysw71zw83ktO7UOOtWrlJ1/+AA+CAUtBuNZ3wAAAABJRU5ErkJggg=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"equation\"\n        title=\"\"\n        src=\"/static/6b0c6eaeb15104ad1cd09520cf79d313/6255c/equation.png\"\n        srcset=\"/static/6b0c6eaeb15104ad1cd09520cf79d313/375dc/equation.png 148w,\n/static/6b0c6eaeb15104ad1cd09520cf79d313/6b157/equation.png 295w,\n/static/6b0c6eaeb15104ad1cd09520cf79d313/6255c/equation.png 590w,\n/static/6b0c6eaeb15104ad1cd09520cf79d313/dcf9c/equation.png 885w,\n/static/6b0c6eaeb15104ad1cd09520cf79d313/87bc8/equation.png 1130w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>Where:</p>\n<ul>\n<li>\n<p><em>Ui</em> represents the net value from release i. This combines a few factors:\n<em>Ui=Vi-Di-Ci</em></p>\n<ul>\n<li><em>Note: assume these are all the same unit — usually dollars, which is a\nfairly generic unit that we can translate to.</em></li>\n<li>How much value (<em>Vi</em>) do users get from a release? For example, they can do\na new workflow that they previously couldn’t.</li>\n<li>How much disutility (<em>Di</em>) do users get from a release? For example, if you\ndelivered a half-baked release which degrades user trust.</li>\n<li>How much cost (<em>Ci</em>) did your team incur from release? For example, 5\nengineers spent 2 weeks on features.</li>\n</ul>\n</li>\n<li>\n<p><em>ri</em> represents the probability a release can happen to yield the value <em>Ui</em>.\nThis models the risk of a release.</p>\n<ul>\n<li><em>Note: assumes that a release is all or nothing. In practice, a release\nwould be delayed or its adoption would be lower than expected. This could be\nmodeled with many more “potential releases” at different probabilities.</em></li>\n<li>For example, this might be: product risk (build the wrong thing),\nengineering risk, and so on.</li>\n<li>For example, you can de-risk a project by having an early release beta\nprogram to receive feedback.</li>\n</ul>\n</li>\n<li>\n<p><em>1/(1+d)^Δti</em> represents the\n“<a href=\"https://en.wikipedia.org/wiki/Discounting#Discount_factor\">discount factor</a>”</p>\n<ul>\n<li><em>d</em> is the discount rate — the value that can be earned per unit of time on\na different investment of similar risk.</li>\n<li><em>Δti</em> is how long has occurred between release i and i-1.</li>\n</ul>\n</li>\n</ul>\n<p>With this, we can model expected user value from a series of releases. While\nI’ve never calculated this explicitly, and this model is highly simplified, it\nlets us compare how each factor relates to one another and the overall plan.</p>\n<h3>Best practices to maximize value, with inspiration from the model</h3>\n<p>Through the teams and launches I’ve been a part of, I’ve gathered some learnings\nabout maximizing value. These also are reflected in the simplistic model above.</p>\n<h4>On thinking through a release plan</h4>\n<ul>\n<li>You should aggressive split a feature into small releases. If it adds no risk\nor cost, then splitting a feature into multiple releases is a great way to\nincrease user value. Earlier and more frequent delivery means parts of the\nfeature can get in the hands of users sooner. In our model, this is reflected\nby the discount factor yielding lower net value.</li>\n<li>There are many considerations to a release plan — feature readiness, market\nconditions, product and engineering risk — and coming up with a plan should be\na collaboration of all interested parties. After the initial planning for a\nproject, consider whether incremental or early releases would be useful.</li>\n</ul>\n<h4>On thinking about engineering design</h4>\n<ul>\n<li>Adding engineering debt or complexity is dangerous. It can complicate all\nfuture development or add risk to all future releases. As such, optimizing for\nthe short-term through engineering complexity can have dramatic consequences\nto long-term user value. This often manifests by building “partial” features\nthat ultimately introduce debt, rather than building the smallest complete\nunit of user value.</li>\n<li>Balance is important — while you should always think of future engineering\ndesign, you shouldn’t over-engineer such that you deliver something to users\nmuch much later. If there is product uncertainty with the future (for example,\nit’s not clear how a feature will be extended or generalized), then you risk\n<a href=\"https://www.sandimetz.com/blog/2016/1/20/the-wrong-abstraction\">building the wrong abstraction</a>\nwhich can slow future development.</li>\n<li>All engineering complexity will result in additional cost or risk, so it is\nalmost always better to\n<a href=\"/circumventing-engineering-complexity\">circumvent complexity</a> when possible.\nBeing a partner in the product process will give you context to think through\nnon-engineering solutions to complexity, thereby increasing expected value.</li>\n</ul>\n<h4>On mitigating risk</h4>\n<ul>\n<li>It’s incredibly helpful to sequence work such that you mitigate risk for large\nreleases. Suppose you are planning a big release in 6 months and the product\nrisk is currently high. You might have the opportunity to halve product risk\nwith a small earlier release to validate hypotheses. This will ultimately\ndouble the final release’s expected user value. You can also apply this\ntechnique when using a new technology with large technical risk. If you\nde-risk a project early with a small release to validate an engineering plan,\nyou will improve the project’s expected value.</li>\n<li>Different types of risk compound one another, so it’s dangerous to combine\nmultiple types of risk in a single release. Consider all types of risk, and\nstrive to focus a release to a single type of risk (e.g. couple riskier\nengineering with less risky product work).</li>\n<li>It’s helpful to think about this from the perspective of “minimizing the worst\noutcome”. In other words, think about what kind of risk is biggest, and what\ncontingencies you have in place. For example, is your engineering design\nresilient to portions of your product changing as a result of beta testing? If\nnot, consider doing that for areas with high product risk, or deferring\nengineering design until you have higher confidence on the product direction.</li>\n</ul>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-1\">\n<p>  Some of the most common types of risk I’ve seen (see\n<a href=\"https://www.sciencedirect.com/science/article/pii/S1877705814002203\">here</a>\nfor more):</p>\n<ul>\n<li><em>Engineering risk</em> — are there a lot of unknowns in the technical plan? Does\nthis use new technologies that aren’t often used? Does this touch a lot of\nold code or systems that the team doesn’t know or that may need\nupdating/refactoring? Will this cause stability fallout?</li>\n<li><em>Product risk</em> — are we confident in the product plan? Will we need to\niterate on the feature for it to be useful? Could it completely flop and\nneed to be re-done, after showing to users?</li>\n<li><em>Team risk</em> — how engaged are team members? If a milestone slips, will that\nmake the team feel demotivated? If added uncertainty or roadblocks come up,\nwill team members move as quickly? How confident are team members in the\nteam’s leadership?</li>\n</ul>\n<a href=\"#fnref-1\" class=\"footnote-backref\">↩</a>\n</li>\n</ol>\n</div>","frontmatter":{"title":"How the best product engineering teams maximize value","date":"April 16, 2018","description":"Reducing risk, eliminating complexity, and sequencing effectively"},"fields":{"readingTime":{"text":"9 min read"}}}},"pageContext":{"slug":"/how-best-product-engineering-teams-max-value/","previous":{"fields":{"slug":"/circumventing-engineering-complexity/"},"frontmatter":{"title":"Circumventing engineering complexity"}},"next":{"fields":{"slug":"/summary-quantifying-detectable-bugs-js/"},"frontmatter":{"title":"Do static type systems actually catch bugs?"}}}}