{"data":{"site":{"siteMetadata":{"title":"Eric Pelz","author":"Eric Pelz"}},"markdownRemark":{"id":"8f315846-07a3-5c11-a85f-66026e0b21a2","excerpt":"It’s extremely common for engineering teams to debate the value of\nstatic versus dynamic typing systems, especially when developing\napplications on the web. The…","html":"<p>It’s extremely common for engineering teams to debate the value of\nstatic versus dynamic typing systems, especially when developing\napplications on the web. The last few years has seen a big rise in\nusage of TypeScript and Flow, which add static type checking to JavaScript (among other benefits).</p>\n<p>Within an engineering team, it’s fairly difficult to determine the\nactual value (or cost) that one attains from switching from a dynamic\nto static typing system.</p>\n<p>A group of researchers created a study to estimate just this: do static\ntype systems improve software quality, and if so, by how much?\nxcxc link to paper</p>\n<p>As a spoiler: 15% of the bugs were detectable by Flow 0.30 and TypeScript 2.0.</p>\n<p>xcxc remove\n“In this study, we empirically quantify how much static type systems improve\nsoftware quality. This is measured against bugs that are public, actually\nchecked in and visible to other developers, potentially impacting them; public\nbugs notably include field bugs, which impact users. We consider public bugs\nbecause they are observable in software repository histories. Public bugs are\nmore likely to be errors understanding the specification because they are\nusually tested and reviewed, and, in the case of field bugs, deployed. Thus,\nthis experiment under-approximates static type systems’ positive impact on\nsoftware quality, especially when one considers all their other potential\nbenefits on documentation, program performance, code completion, and code\nnavigation.”</p>\n<h2>Definition and methodology</h2>\n<p>The team defined a bug as <code class=\"language-text\">ts-detectable</code><sup id=\"fnref-1\"><a href=\"#fn-1\" class=\"footnote-ref\">1</a></sup> when using type annotations would\ncause the program containing the bug to error on a line changed by\na bug fix, and when the new annotations are consistent with the fixed program.</p>\n<p>At the time of analysis (08/19/2015), there were 3,910,969 closed bug reports\non open-source JavaScript projects on GitHub. The authors wanted a 95% confidence\nlevel, and so selected 400 bugs at random for the experiment.</p>\n<p>For each bug, the researchers checked in both TypeScript and Flow whether it\nwas <code class=\"language-text\">ts-detectable</code>. To do so, they did a first-pass filter to see if the report\nis absolutely not type-related (for example, the bug was due to a misunderstanding\nof the specification), and if so was labeled undetectable. Next, the researchers\nlooked at the intended behavior of the bug fix and attempted to add annotations\nto cause the type system to error at the area of code patched by the bug fix.\nIf so, the sample was deemed <code class=\"language-text\">ts-detectable</code>, otherwise it was not.\nThe researchers also set a time-bound for each bug to 10 minutes, a number based\non preliminary sampling of bugs, after which the sample was deemed unknown.</p>\n<h2>Results</h2>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/b9d2543172f4e4a8451901a241a9228f/68866/histo_tc_detectable.png\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 47.63888888888889%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAKCAYAAAC0VX7mAAAACXBIWXMAAAsTAAALEwEAmpwYAAABiklEQVQoz42Syy/EUBTG5z+1mSDBH2DFBksLsSSMIPFYkLARIiHEMxKhHSbz6PSpipnWPLS9n3NPa0wmk9DkpF/vPfd3v9NzMnEc4+eJol8t14UQpAS/hYg7mvco4p6Qexl5+E7z8ex8MqjoNnBbqfPhkC6oN0OSAq2vCPNHOp7sJC9KAb3BwMmdIhZPDE5cv7Awvl1gnbcCjK7m0WyHFBGySwouix+8Jy+L+7hk4Mx+GSvnFiduXTuY3C2yVgiYXVbQJHftMMbYWh435frfDqf3SsidmZy4eeVgYicFmgGGcioa5E6WPEJur8u1vx1OdQE3eoCDOYWA4S+w9A/gzF7/klUqeXhF5f8ngUnJ3cCfrouO7tMUu9OUB8PHwMIDlyz/IzcldZiMWzpCXSOVkWKNIAePb5x4rHpYOk3g1bcWZg807vJXJDB3qEM1fd67NwIU0lHTKE+OnmSxw5cXB7WPZByCwCf9ziUYhgHLNOC6LodtmfA8D45jo1SpQjdtvNJ6RdPpW6d1B98ZyupZWoWDSAAAAABJRU5ErkJggg=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"histo tc detectable\"\n        title=\"\"\n        src=\"/static/b9d2543172f4e4a8451901a241a9228f/6255c/histo_tc_detectable.png\"\n        srcset=\"/static/b9d2543172f4e4a8451901a241a9228f/375dc/histo_tc_detectable.png 148w,\n/static/b9d2543172f4e4a8451901a241a9228f/6b157/histo_tc_detectable.png 295w,\n/static/b9d2543172f4e4a8451901a241a9228f/6255c/histo_tc_detectable.png 590w,\n/static/b9d2543172f4e4a8451901a241a9228f/68866/histo_tc_detectable.png 720w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>The team was able to label all 400 bug samples: Each of Flow and TypeScript\ndetected 60 of the bugs. This means at the confidence level of 95%, the\npercentage of detectable bugs for both fall into [11.5%, 18.5%] with mean 15%.</p>\n<p>Note that note of the bugs were easy to determine: only 18 of the 400 hit the\ntime-box period of 10 minutes, mostly due to external modules and interfaces\nmaking it harder to isolate the area of interest. The team spent more time on\nthese bugs, utilizing the DefinitelyTyped published type definitions and documentation\nwhen necessary, and were able to classify them all.</p>\n<h3>Caveats</h3>\n<p>The authors think this greatly understates the impact of static typing, because:</p>\n<ul>\n<li>They only surveyed publicly visible bugs, which means any bug caught during\ndevelopment was not included. They also think public bugs are more often cause\nby misunderstanding of the specification, which type systems cannot detect.</li>\n<li>This doesn’t include any other strengths of static type systems, like\ndeveloper efficiency or app performance.</li>\n<li>This experiment uses relatively weak type systems of TypeScript and Flow.</li>\n<li>The authors have limited expertise in Flow and TypeScript, which means they\ncould have incorrectly deemed bug as undetectable.</li>\n</ul>\n<p>Classifying ts-undetectable bugs</p>\n<ul>\n<li>Most errors were “specification errors” - 186/400 (55%). Errors implementing\nspecification overwhelmingly constitute 78%. This demonstrates the importance\nof careful specification before development.</li>\n<li>StringError was the second most common error type - errors caused by incorrect\ncontent of a string (e.g. wrong URL).</li>\n<li>Authors theorize this is due to: (1) lots of URLs and other strings in\nJavaScript, (2) the string type being very opaque in most type systems.</li>\n</ul>\n<h3>TS vs Flow</h3>\n<ul>\n<li>TypeScript 2.0 added null handling. 22 of the 60 ts-detectable bugs needed\nnull checks (i.e. they needed —strictNullChecks and TS 2.0, rather than TS\n1.8).</li>\n<li>\n<p>TypeScript and Flow’s coverage were largely overlapping, with 6 exceptions: 3\nwere only Flow-detectable and 3 were only TypeScript detectable.</p>\n<ul>\n<li>All three Flow-detectable-only bugs were due to concatenating a possible\nundefined/null value with another string. For example, var x = ” ” + null +\n” ”; This highlighted a TypeScript weakness (at least as of version 2.0).</li>\n<li>Two of the three TypeScript-detectable-only bugs were due to Flow’s\nincomplete support for using string literals as an index.</li>\n</ul>\n</li>\n</ul>\n<h2>Cost</h2>\n<ul>\n<li>\n<p>Directly measuring the effort programmers must spend to annotate programs with\na static type system would be very hard. The authors instead approximate:\ntoken tax, “the number of tokens in the added type annotations”, and time tax,\n“the time spent adding annotations.”</p>\n<ul>\n<li>Token tax aims to proxy the number of decisions a programmer must make when\nadding type annotations. That is, for a ts-detectable bugs, the number of\ntokens in the annotation needed to trigger a type error.</li>\n</ul>\n</li>\n<li>These measures are a huge underestimate, because they only measure the\n“annotation tax” in a per-bug manner, where the authors have a very localized\nannotation effort determined only to target the bug in question (not the\nentire file).</li>\n<li>They lie under the assumption that the project has fully embraced using a\nstatic type checker, so the codebase would already be annotated prior to the\nbug being introduced. Thus, their metric measures just the time and tokens\nrequired for the <em>additional annotations</em> at the time of the bug-introducing\nchange. In other words, it measures incrementally adding/annotating patches on\nan already annotated code base.</li>\n<li>\n<p>Using this measure, they find the mean per-bug annotation tax: For Flow there\nare 1.7 tokens and 231 seconds required to detect a bug, and 2.4 tokens and\n306 seconds for TypeScript.</p>\n<ul>\n<li>Why discrepancy? Flow implements stronger type inference, and has a more\ncompact syntax for nullable types. This was most dramatic in the time saved\n— Flow frequently could infer types and thus the authors did not even need\nto read the bug report and fix to add a consistent type annotation.</li>\n</ul>\n</li>\n</ul>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-1\">\n<blockquote>\n<p>Definition for <code class=\"language-text\">ts-detectable</code>: Given a static type system <code class=\"language-text\">ts</code>, a bug <code class=\"language-text\">b</code> is\n<code class=\"language-text\">ts-detectable</code> when adding or changing type annotations causes the program <code class=\"language-text\">p</code>\ncontaining <code class=\"language-text\">b</code> to error on a line changed by a fix and the new annotations are\nconsistent with <code class=\"language-text\">f</code>, a fixed version of <code class=\"language-text\">p</code>.</p>\n</blockquote>\n<a href=\"#fnref-1\" class=\"footnote-backref\">↩</a>\n</li>\n</ol>\n</div>","frontmatter":{"title":"Quantifying Detectable Bugs in JavaScript","date":"March 24, 2019","description":"xcxc"},"fields":{"readingTime":{"text":"6 min read"}}}},"pageContext":{"slug":"/summary-quantifying-detectable-bugs-js/","previous":{"fields":{"slug":"/how-best-product-engineering-teams-max-value/"},"frontmatter":{"title":"How the best product engineering teams maximize value"}},"next":null}}